app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getUsers(array $where = [], array $filter = ['*'], $groupBy = false)
    {
        try {
            $search = $this->db->table($this->tableUsers)
                ->select($filter)
                ->where($where)
                ->get();
            $response = $groupBy == false ? $search->getResultObject() : $search->getFirstRow();

INSERT INTO `users` (`NAME`, `EMAIL`, `PHONE`, `PASSWORD`, `HASH`, `USER_INSERT`) VALUES ('Lucas Araujo', 'lucas23@gmail.com', '35910018923', '$2y$10$/HVi9VtoVmH9C.cWY.VAVeyPrMJJBTOatiNIBVV7uvGVvgUCUEEk.', '761f3a10-ec90-4e46-9436-f493debd27fe', '3')
---
    public function createUser(array $data)
    {
        try {
            $this->db->table($this->tableUsers)->insert($data);

UPDATE `users` SET `NAME` = 'Lucas2 Araujo', `EMAIL` = 'lucas83@gmail.com', `PHONE` = '35910018923', `PASSWORD` = '$2y$10$r3G9of.S3PCK/Ef7G62uwuNyaMA6Zi4he1EbKAVr2p6AwcZlYQ...', `USER_UPDATE` = '3', `DTHR_UPDATE` = '2025-06-29 00:23:21'
WHERE `HASH` = 'a31067fd-5445-11f0-a0bf-0242c0a83002'
---
    public function updateUser(array $where = [], array $columns = [])
    {
        try {
            $response = $this->db->table($this->tableUsers)
                ->set($columns)
                ->where($where)
                ->update();